### Forest: Sync Check Service Infrastructure Plan: success

<details><summary>Show Plan</summary>

```
module.sync_check.data.local_file.init: Reading...
module.sync_check.data.external.sources_tar: Reading...
module.sync_check.data.local_file.init: Read complete after 0s [id=6f71d9b174cdbf115f8a7d02d6d7d2e8a830bc9d]
module.sync_check.data.external.sources_tar: Read complete after 0s [id=-]
module.sync_check.data.local_file.sources: Reading...
module.sync_check.data.digitalocean_ssh_keys.keys: Reading...
module.sync_check.data.digitalocean_project.forest_project: Reading...
module.sync_check.data.local_file.sources: Read complete after 0s [id=4dfe7d59f3bcc248f9f9de4884904dbafa0cb031]
module.sync_check.data.digitalocean_ssh_keys.keys: Read complete after 1s [id=ssh_keys/4003270040538543685]
module.sync_check.digitalocean_droplet.forest: Refreshing state... [id=366292120]
module.sync_check.data.digitalocean_project.forest_project: Read complete after 4s [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
module.sync_check.digitalocean_project_resources.connect_forest_project: Refreshing state... [id=da5e6601-7fd9-4d02-951e-390f7feb3411]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.sync_check.digitalocean_droplet.forest must be replaced
-/+ resource "digitalocean_droplet" "forest" {
      ~ created_at           = "2023-07-21T10:39:33Z" -> (known after apply)
      ~ disk                 = 300 -> (known after apply)
      ~ id                   = "366292120" -> (known after apply)
      ~ ipv4_address         = "159.89.20.208" -> (known after apply)
      ~ ipv4_address_private = "10.135.0.2" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 16384 -> (known after apply)
        name                 = "forest-sync-check"
      ~ price_hourly         = 0.19494 -> (known after apply)
      ~ price_monthly        = 131 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ status               = "active" -> (known after apply)
        tags                 = [
            "iac",
        ]
      ~ urn                  = "do:droplet:366292120" -> (known after apply)
      ~ user_data            = "cfdd97e800754e7e2fc007f07a3e156ffc23edd6" -> "dde06025efd39606c4ecc77cdef812663e33c747" # forces replacement
      ~ vcpus                = 2 -> (known after apply)
      ~ volume_ids           = [] -> (known after apply)
      ~ vpc_uuid             = "46a525ac-fd37-47ea-bb10-95c1db0055f7" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.sync_check.digitalocean_project_resources.connect_forest_project will be updated in-place
  ~ resource "digitalocean_project_resources" "connect_forest_project" {
        id        = "da5e6601-7fd9-4d02-951e-390f7feb3411"
      ~ resources = [
          - "do:droplet:366292120",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ ip = [
      - [
          - "159.89.20.208",
        ],
      + [
          + (known after apply),
        ],
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>